<script setup lang="ts">
/**
 * PaperClipOutlined - Ant Design 官方回形针图标
 * 来源: @ant-design/icons-svg/svg/outlined/paper-clip.svg
 * 用于 Upload 文件列表文件图标
 */
</script>

<template>
    <svg viewBox="0 0 1024 1024" focusable="false" fill="currentColor" width="1em" height="1em" aria-hidden="true">
        <path
            d="M582.677333 139.370667l-392.106666 392.106666a213.525333 213.525333 0 1 0 301.973333 301.952l392.106667-392.106666a42.624 42.624 0 0 1 60.266666 60.288l-392.106666 392.106666A298.752 298.752 0 0 1 130.304 471.189333l392.106667-392.106666a213.376 213.376 0 0 1 301.76 301.781333l-392.533334 392.106667a128 128 0 1 1-181.013333-181.034667l362.24-361.813333a42.624 42.624 0 0 1 60.245333 60.309333L310.890667 652.224a42.752 42.752 0 1 0 60.48 60.458667l392.533333-392.106667a128.149333 128.149333 0 0 0-181.226667-181.205333z"
            fill="#000000"
            p-id="7074"
        ></path>
    </svg>
</template>
